#Использовать autumn
#Использовать asserts
#Использовать "."
#Использовать ".."

&Тест
Процедура БлокировкаДобавляется() Экспорт

	// Дано

	Поделка = Новый Поделка();
	Поделка.ДобавитьЖелудь(Тип("СинхронизированныйЖелудь"))
		.ЗапуститьПриложение();

	// Когда

	Результат = Поделка.НайтиЖелудь("СинхронизированныйЖелудь");

	// Тогда

	Рефлектор = Новый Рефлектор();
	Блокировка = Рефлектор.ПолучитьСвойство(Результат, "НапильникСинхронизировано_Блокировка");

	Ожидаем.Что(Блокировка).ИмеетТип("БлокировкаРесурса");

КонецПроцедуры

&Тест
Процедура МетодСинхронизируется() Экспорт

	// Дано

	Поделка = Новый Поделка();
	Поделка.ДобавитьЖелудь(Тип("СинхронизированныйЖелудь"))
		.ЗапуститьПриложение();

	Желудь = Поделка.НайтиЖелудь("СинхронизированныйЖелудь");

	// Когда

	Для Счетчик = 1 По 50 Цикл
		ФоновыеЗадания.Выполнить(Желудь, "Инкремент");
	КонецЦикла;

	ФоновыеЗадания.ОжидатьЗавершенияЗадач();

	// Тогда

	Ожидаем.Что(Желудь.ПолучитьЗначение()).Равно(50);

КонецПроцедуры
